[Killed] BlockStatement
src/components/LoginForm/LoginForm.tsx:15:24
 
   return (
     <form
-      onSubmit={(e) => {
-        e.preventDefault()
-        localStorage.setItem("auth", term)
-        if (term) {
-          navigate("/game", { replace: true })
-          location.reload()
-        }
-      }}
+      onSubmit={(e) => {}}
     >
       <div className={styles.centerScreen}>
killedBy: App render tests render APP test
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "/game"
Received string:    "/login"

[Survived] StringLiteral
src/components/LoginForm/LoginForm.tsx:17:30
     <form
       onSubmit={(e) => {
         e.preventDefault()
-        localStorage.setItem("auth", term)
+        localStorage.setItem("", term)
         if (term) {
           navigate("/game", { replace: true })

[Killed] BlockStatement
src/components/LoginForm/LoginForm.tsx:18:19
       onSubmit={(e) => {
         e.preventDefault()
         localStorage.setItem("auth", term)
-        if (term) {
-          navigate("/game", { replace: true })
-          location.reload()
-        }
+        if (term) {}
       }}
     >
killedBy: App render tests render APP test
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "/game"
Received string:    "/login"

[Killed] ConditionalExpression
src/components/LoginForm/LoginForm.tsx:18:13
       onSubmit={(e) => {
         e.preventDefault()
         localStorage.setItem("auth", term)
-        if (term) {
+        if (false) {
           navigate("/game", { replace: true })
           location.reload()
killedBy: App render tests render APP test
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "/game"
Received string:    "/login"

[Survived] BooleanLiteral
src/components/LoginForm/LoginForm.tsx:19:40
         e.preventDefault()
         localStorage.setItem("auth", term)
         if (term) {
-          navigate("/game", { replace: true })
+          navigate("/game", { replace: false })
           location.reload()
         }

[Killed] StringLiteral
src/components/LoginForm/LoginForm.tsx:19:20
         e.preventDefault()
         localStorage.setItem("auth", term)
         if (term) {
-          navigate("/game", { replace: true })
+          navigate("", { replace: true })
           location.reload()
         }
killedBy: App render tests render APP test
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "/game"
Received string:    "/login"

[Killed] ArrowFunction
src/components/LoginForm/LoginForm.tsx:30:21
         <input
           type="text"
           placeholder="Input your name"
-          onChange={(e) => setTerm(e.target.value)}
+          onChange={() => undefined}
         />
         <button
killedBy: App render tests render APP test
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "/game"
Received string:    "/login"
