[Killed] BlockStatement
src/components/App/App.tsx:6:36
 import { BrowserRouter } from "react-router-dom"
 import { AppRouter } from "../Routes/AppRouter"
 
-export const App: React.FC = () => {
-  const [userName, setUserName] = useState<string | null>(null)
-
-  useEffect(() => {
-    setUserName(localStorage.getItem("auth"))
-  }, [])
-  return (
-    <AuthContext.Provider
-      value={{
-        userName: userName,
-        setUserName: setUserName,
-      }}
-    >
-      <BrowserRouter>
-        <AppRouter />
-      </BrowserRouter>
-    </AuthContext.Provider>
-  )
-}
+export const App: React.FC = () => {}
 
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BlockStatement
src/components/App/App.tsx:9:19
 export const App: React.FC = () => {
   const [userName, setUserName] = useState<string | null>(null)
 
-  useEffect(() => {
-    setUserName(localStorage.getItem("auth"))
-  }, [])
+  useEffect(() => {}, [])
   return (
     <AuthContext.Provider

[Survived] ObjectLiteral
src/components/App/App.tsx:14:14
   }, [])
   return (
     <AuthContext.Provider
-      value={{
-        userName: userName,
-        setUserName: setUserName,
-      }}
+      value={{}}
     >
       <BrowserRouter>
