[Killed] BlockStatement
src/components/Cell/Cell.tsx:16:7
   height,
   id,
   onClick,
-}) => {
-  const classes = `${styles.cell} ${alive ? styles.cellAlive : styles.cellDead}`
-  return (
-    <div
-      id={id}
-      className={classes}
-      style={{ width, height }}
-      onClick={onClick}
-      data-testid={id}
-    ></div>
-  )
-}
+}) => {}
 
killedBy: render tests has cell inside
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="header"
