[Killed] BlockStatement
src/components/Field/Field.tsx:21:80
   height,
   cellCount,
 }) => {
-  const renderChildren = (width: number, height: number, cellCount: number) => {
-    const { value } = useSelector<AppStateType, FlowSliceState>(flowState)
-    const dispatch = useDispatch()
-
-    const cards = []
-    for (let index = 0; value && index < cellCount; index++) {
-      cards.push(
-        <Cell
-          key={index.toString()}
-          id={index.toString()}
-          alive={value[index]}
-          width={width}
-          height={height}
-          onClick={() => {
-            dispatch(mutate({ cellIndex: index }))
-          }}
-        ></Cell>
-      )
-    }
-    return cards
-  }
+  const renderChildren = (width: number, height: number, cellCount: number) => {}
 
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
killedBy: render tests has cell inside
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="header"

[Killed] ConditionalExpression
src/components/Field/Field.tsx:26:25
     const dispatch = useDispatch()
 
     const cards = []
-    for (let index = 0; value && index < cellCount; index++) {
+    for (let index = 0; false; index++) {
       cards.push(
         <Cell
killedBy: render tests has cell inside
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="header"

[Killed] BlockStatement
src/components/Field/Field.tsx:26:62
     const dispatch = useDispatch()
 
     const cards = []
-    for (let index = 0; value && index < cellCount; index++) {
-      cards.push(
-        <Cell
-          key={index.toString()}
-          id={index.toString()}
-          alive={value[index]}
-          width={width}
-          height={height}
-          onClick={() => {
-            dispatch(mutate({ cellIndex: index }))
-          }}
-        ></Cell>
-      )
-    }
+    for (let index = 0; value && index < cellCount; index++) {}
     return cards
   }
killedBy: render tests has cell inside
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="header"

[Survived] BlockStatement
src/components/Field/Field.tsx:34:26
           alive={value[index]}
           width={width}
           height={height}
-          onClick={() => {
-            dispatch(mutate({ cellIndex: index }))
-          }}
+          onClick={() => {}}
         ></Cell>
       )

[Survived] LogicalOperator
src/components/Field/Field.tsx:44:21
   }
 
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
-  const elemWidth = cellCount && width ? width / elemInRow : 0
+  const elemWidth = cellCount || width ? width / elemInRow : 0
   const elemHeight = cellCount && height ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width

[Survived] ArithmeticOperator
src/components/Field/Field.tsx:44:42
   }
 
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
-  const elemWidth = cellCount && width ? width / elemInRow : 0
+  const elemWidth = cellCount && width ? width * elemInRow : 0
   const elemHeight = cellCount && height ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width

[Survived] LogicalOperator
src/components/Field/Field.tsx:45:22
 
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
   const elemWidth = cellCount && width ? width / elemInRow : 0
-  const elemHeight = cellCount && height ? height / elemInRow : 0
+  const elemHeight = cellCount || height ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =

[Survived] ConditionalExpression
src/components/Field/Field.tsx:45:22
 
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
   const elemWidth = cellCount && width ? width / elemInRow : 0
-  const elemHeight = cellCount && height ? height / elemInRow : 0
+  const elemHeight = true ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =

[Survived] EqualityOperator
src/components/Field/Field.tsx:46:11
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
   const elemWidth = cellCount && width ? width / elemInRow : 0
   const elemHeight = cellCount && height ? height / elemInRow : 0
-  width = elemInRow > 0 ? elemInRow * elemWidth : width
+  width = elemInRow <= 0 ? elemInRow * elemWidth : width
   height =
     cellCount && elemInRow > 0

[Survived] EqualityOperator
src/components/Field/Field.tsx:46:11
   const elemInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
   const elemWidth = cellCount && width ? width / elemInRow : 0
   const elemHeight = cellCount && height ? height / elemInRow : 0
-  width = elemInRow > 0 ? elemInRow * elemWidth : width
+  width = elemInRow >= 0 ? elemInRow * elemWidth : width
   height =
     cellCount && elemInRow > 0

[Survived] LogicalOperator
src/components/Field/Field.tsx:48:5
   const elemHeight = cellCount && height ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =
-    cellCount && elemInRow > 0
+    cellCount || elemInRow > 0
       ? Math.ceil(cellCount / elemInRow) * elemHeight
       : height

[Survived] ConditionalExpression
src/components/Field/Field.tsx:48:5
   const elemHeight = cellCount && height ? height / elemInRow : 0
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =
-    cellCount && elemInRow > 0
+    false
       ? Math.ceil(cellCount / elemInRow) * elemHeight
       : height

[Survived] ArithmeticOperator
src/components/Field/Field.tsx:49:19
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =
     cellCount && elemInRow > 0
-      ? Math.ceil(cellCount / elemInRow) * elemHeight
+      ? Math.ceil(cellCount * elemInRow) * elemHeight
       : height
   return (

[Survived] ArithmeticOperator
src/components/Field/Field.tsx:49:9
   width = elemInRow > 0 ? elemInRow * elemWidth : width
   height =
     cellCount && elemInRow > 0
-      ? Math.ceil(cellCount / elemInRow) * elemHeight
+      ? Math.ceil(cellCount / elemInRow) / elemHeight
       : height
   return (

[Survived] ObjectLiteral
src/components/Field/Field.tsx:57:16
       <div
         key="fld"
         className={styles.field}
-        style={{
-          width,
-          height,
-        }}
+        style={{}}
       >
         {cellCount

[Survived] ArithmeticOperator
src/components/Field/Field.tsx:63:28
         }}
       >
         {cellCount
-          ? renderChildren(elemWidth - 2, elemHeight - 2, cellCount)
+          ? renderChildren(elemWidth + 2, elemHeight - 2, cellCount)
           : ""}
       </div>

[Survived] ArithmeticOperator
src/components/Field/Field.tsx:63:43
         }}
       >
         {cellCount
-          ? renderChildren(elemWidth - 2, elemHeight - 2, cellCount)
+          ? renderChildren(elemWidth - 2, elemHeight + 2, cellCount)
           : ""}
       </div>

[Survived] StringLiteral
src/components/Field/Field.tsx:64:13
       >
         {cellCount
           ? renderChildren(elemWidth - 2, elemHeight - 2, cellCount)
-          : ""}
+          : "Stryker was here!"}
       </div>
     </div>
