[Killed] BlockStatement
src/components/Game/Game.ts:10:17
 export const initialize = (
   cellCount: number,
   percentage: number
-): boolean[] => {
-  let liveAmount = (cellCount * percentage) / 100
-  const states: boolean[] = new Array(cellCount)
-  if (liveAmount === cellCount) {
-    states.fill(true, 0, cellCount)
-    return states
-  }
-  states.fill(false, 0, cellCount)
-  const freeCells: number[] = [...Array(cellCount).keys()]
-
-  while (liveAmount > 0) {
-    const random = generateRandom(freeCells.length)
-    states[freeCells[random]] = true
-    freeCells.splice(random, 1)
-    liveAmount--
-  }
-  return states
-}
+): boolean[] => {}
 
 export const mutateCell = (cellIndex: number, states: boolean[]) =>
killedBy: render tests state test cells count
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:11:20
   cellCount: number,
   percentage: number
 ): boolean[] => {
-  let liveAmount = (cellCount * percentage) / 100
+  let liveAmount = cellCount * percentage * 100
   const states: boolean[] = new Array(cellCount)
   if (liveAmount === cellCount) {

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:11:21
   cellCount: number,
   percentage: number
 ): boolean[] => {
-  let liveAmount = (cellCount * percentage) / 100
+  let liveAmount = (cellCount / percentage) / 100
   const states: boolean[] = new Array(cellCount)
   if (liveAmount === cellCount) {

[Killed] ArrayDeclaration
src/components/Game/Game.ts:12:29
   percentage: number
 ): boolean[] => {
   let liveAmount = (cellCount * percentage) / 100
-  const states: boolean[] = new Array(cellCount)
+  const states: boolean[] = new Array()
   if (liveAmount === cellCount) {
     states.fill(true, 0, cellCount)
killedBy: render tests state test percentage
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] EqualityOperator
src/components/Game/Game.ts:13:7
 ): boolean[] => {
   let liveAmount = (cellCount * percentage) / 100
   const states: boolean[] = new Array(cellCount)
-  if (liveAmount === cellCount) {
+  if (liveAmount !== cellCount) {
     states.fill(true, 0, cellCount)
     return states
killedBy: init tests 0 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ConditionalExpression
src/components/Game/Game.ts:13:7
 ): boolean[] => {
   let liveAmount = (cellCount * percentage) / 100
   const states: boolean[] = new Array(cellCount)
-  if (liveAmount === cellCount) {
+  if (true) {
     states.fill(true, 0, cellCount)
     return states
killedBy: init tests 0 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] BooleanLiteral
src/components/Game/Game.ts:14:17
   let liveAmount = (cellCount * percentage) / 100
   const states: boolean[] = new Array(cellCount)
   if (liveAmount === cellCount) {
-    states.fill(true, 0, cellCount)
+    states.fill(false, 0, cellCount)
     return states
   }
killedBy: render tests state test percentage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/components/Game/Game.ts:17:15
     states.fill(true, 0, cellCount)
     return states
   }
-  states.fill(false, 0, cellCount)
+  states.fill(true, 0, cellCount)
   const freeCells: number[] = [...Array(cellCount).keys()]
 
killedBy: init tests 0 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ArrayDeclaration
src/components/Game/Game.ts:18:31
     return states
   }
   states.fill(false, 0, cellCount)
-  const freeCells: number[] = [...Array(cellCount).keys()]
+  const freeCells: number[] = []
 
   while (liveAmount > 0) {
killedBy: init tests 30 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] EqualityOperator
src/components/Game/Game.ts:20:10
   states.fill(false, 0, cellCount)
   const freeCells: number[] = [...Array(cellCount).keys()]
 
-  while (liveAmount > 0) {
+  while (liveAmount >= 0) {
     const random = generateRandom(freeCells.length)
     states[freeCells[random]] = true
killedBy: init tests 0 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/components/Game/Game.ts:20:10
   states.fill(false, 0, cellCount)
   const freeCells: number[] = [...Array(cellCount).keys()]
 
-  while (liveAmount > 0) {
+  while (false) {
     const random = generateRandom(freeCells.length)
     states[freeCells[random]] = true
killedBy: init tests 30 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] BooleanLiteral
src/components/Game/Game.ts:22:33
 
   while (liveAmount > 0) {
     const random = generateRandom(freeCells.length)
-    states[freeCells[random]] = true
+    states[freeCells[random]] = false
     freeCells.splice(random, 1)
     liveAmount--
killedBy: init tests 30 % filled 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Timeout] UpdateOperator
src/components/Game/Game.ts:24:5
     const random = generateRandom(freeCells.length)
     states[freeCells[random]] = true
     freeCells.splice(random, 1)
-    liveAmount--
+    liveAmount++
   }
   return states

[Killed] ArrowFunction
src/components/Game/Game.ts:29:27
   return states
 }
 
-export const mutateCell = (cellIndex: number, states: boolean[]) =>
-  states.map((state, index) => (index === cellIndex ? !state : state))
+export const mutateCell = () => undefined
 
 export const nextStep = (states: boolean[], cellInRow: number) =>
killedBy: mutate tests 0 mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [false, false]
Received: undefined

[Killed] ConditionalExpression
src/components/Game/Game.ts:30:33
 }
 
 export const mutateCell = (cellIndex: number, states: boolean[]) =>
-  states.map((state, index) => (index === cellIndex ? !state : state))
+  states.map((state, index) => (true ? !state : state))
 
 export const nextStep = (states: boolean[], cellInRow: number) =>
killedBy: mutate tests 0 mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    false,
-   false,

[Killed] ConditionalExpression
src/components/Game/Game.ts:30:33
 }
 
 export const mutateCell = (cellIndex: number, states: boolean[]) =>
-  states.map((state, index) => (index === cellIndex ? !state : state))
+  states.map((state, index) => (false ? !state : state))
 
 export const nextStep = (states: boolean[], cellInRow: number) =>
killedBy: mutate tests 0 mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   false,
+   true,

[Killed] ArrowFunction
src/components/Game/Game.ts:32:25
 export const mutateCell = (cellIndex: number, states: boolean[]) =>
   states.map((state, index) => (index === cellIndex ? !state : state))
 
-export const nextStep = (states: boolean[], cellInRow: number) =>
-  states.map((state, index) => nextStepForCell(states, cellInRow, index))
+export const nextStep = () => undefined
 
 export const nextStepForCell = (
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  1

  Object {
-   "value": Array [
-     true,

[Killed] ArrowFunction
src/components/Game/Game.ts:33:14
   states.map((state, index) => (index === cellIndex ? !state : state))
 
 export const nextStep = (states: boolean[], cellInRow: number) =>
-  states.map((state, index) => nextStepForCell(states, cellInRow, index))
+  states.map(() => undefined)
 
 export const nextStepForCell = (
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Object {
    "value": Array [
-     true,

[Killed] EqualityOperator
src/components/Game/Game.ts:40:7
   cellInRow: number,
   cellIndex: number
 ) => {
-  if (states.length === 1) {
+  if (states.length !== 1) {
     return states[0]
   }
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Survived] BlockStatement
src/components/Game/Game.ts:40:28
   cellInRow: number,
   cellIndex: number
 ) => {
-  if (states.length === 1) {
-    return states[0]
-  }
+  if (states.length === 1) {}
   let aliveNeighbourCount = 0
   switch (cellIndex) {

[Killed] ConditionalExpression
src/components/Game/Game.ts:45:5
   }
   let aliveNeighbourCount = 0
   switch (cellIndex) {
-    case 0:
-      aliveNeighbourCount =
-        getValue(states, cellIndex + 1) +
-        getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow + 1)
-      break
+    case 0:
     case cellInRow - 1:
       aliveNeighbourCount =
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/components/Game/Game.ts:47:26
   switch (cellIndex) {
     case 0:
       aliveNeighbourCount =
-        getValue(states, cellIndex + 1) +
+        getValue(states, cellIndex - 1) +
         getValue(states, cellIndex + cellInRow) +
         getValue(states, cellIndex + cellInRow + 1)
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/components/Game/Game.ts:47:9
   switch (cellIndex) {
     case 0:
       aliveNeighbourCount =
-        getValue(states, cellIndex + 1) +
-        getValue(states, cellIndex + cellInRow) +
+        getValue(states, cellIndex + 1) - getValue(states, cellIndex + cellInRow) +
         getValue(states, cellIndex + cellInRow + 1)
       break
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/components/Game/Game.ts:48:26
     case 0:
       aliveNeighbourCount =
         getValue(states, cellIndex + 1) +
-        getValue(states, cellIndex + cellInRow) +
+        getValue(states, cellIndex - cellInRow) +
         getValue(states, cellIndex + cellInRow + 1)
       break
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/components/Game/Game.ts:49:26
       aliveNeighbourCount =
         getValue(states, cellIndex + 1) +
         getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow + 1)
+        getValue(states, cellIndex + cellInRow - 1)
       break
     case cellInRow - 1:
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:49:26
       aliveNeighbourCount =
         getValue(states, cellIndex + 1) +
         getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow + 1)
+        getValue(states, cellIndex - cellInRow + 1)
       break
     case cellInRow - 1:

[Timeout] ConditionalExpression
src/components/Game/Game.ts:51:5
         getValue(states, cellIndex + cellInRow) +
         getValue(states, cellIndex + cellInRow + 1)
       break
-    case cellInRow - 1:
-      aliveNeighbourCount =
-        getValue(states, cellIndex - 1) +
-        getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow - 1)
-      break
+    case cellInRow - 1:
     default: {
       const remainder = cellIndex % cellInRow

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:51:10
         getValue(states, cellIndex + cellInRow) +
         getValue(states, cellIndex + cellInRow + 1)
       break
-    case cellInRow - 1:
+    case cellInRow + 1:
       aliveNeighbourCount =
         getValue(states, cellIndex - 1) +

[Killed] ArithmeticOperator
src/components/Game/Game.ts:53:9
       break
     case cellInRow - 1:
       aliveNeighbourCount =
-        getValue(states, cellIndex - 1) +
-        getValue(states, cellIndex + cellInRow) +
+        getValue(states, cellIndex - 1) - getValue(states, cellIndex + cellInRow) +
         getValue(states, cellIndex + cellInRow - 1)
       break
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Object {
    "value": Array [

[Killed] ArithmeticOperator
src/components/Game/Game.ts:53:9
       break
     case cellInRow - 1:
       aliveNeighbourCount =
-        getValue(states, cellIndex - 1) +
-        getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow - 1)
+        getValue(states, cellIndex - 1) + getValue(states, cellIndex + cellInRow) - getValue(states, cellIndex + cellInRow - 1)
       break
     default: {
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Object {
    "value": Array [

[Survived] ArithmeticOperator
src/components/Game/Game.ts:54:26
     case cellInRow - 1:
       aliveNeighbourCount =
         getValue(states, cellIndex - 1) +
-        getValue(states, cellIndex + cellInRow) +
+        getValue(states, cellIndex - cellInRow) +
         getValue(states, cellIndex + cellInRow - 1)
       break

[Survived] ArithmeticOperator
src/components/Game/Game.ts:55:26
       aliveNeighbourCount =
         getValue(states, cellIndex - 1) +
         getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow - 1)
+        getValue(states, cellIndex + cellInRow + 1)
       break
     default: {

[Survived] ArithmeticOperator
src/components/Game/Game.ts:55:26
       aliveNeighbourCount =
         getValue(states, cellIndex - 1) +
         getValue(states, cellIndex + cellInRow) +
-        getValue(states, cellIndex + cellInRow - 1)
+        getValue(states, cellIndex - cellInRow - 1)
       break
     default: {

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:58:25
         getValue(states, cellIndex + cellInRow - 1)
       break
     default: {
-      const remainder = cellIndex % cellInRow
+      const remainder = cellIndex * cellInRow
       switch (remainder) {
         case 0:

[Killed] ConditionalExpression
src/components/Game/Game.ts:60:9
     default: {
       const remainder = cellIndex % cellInRow
       switch (remainder) {
-        case 0:
-          aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex + 1,
-            cellIndex + cellInRow,
-            cellIndex + cellInRow + 1,
-            cellIndex - cellInRow,
-            cellIndex - cellInRow + 1,
-          ])
-          break
+        case 0:
         case cellInRow - 1:
           aliveNeighbourCount = sumNeighbours(states, [
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "value": Array [
      true,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:62:13
       switch (remainder) {
         case 0:
           aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex + 1,
+            cellIndex - 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow + 1,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:63:13
         case 0:
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex + 1,
-            cellIndex + cellInRow,
+            cellIndex - cellInRow,
             cellIndex + cellInRow + 1,
             cellIndex - cellInRow,

[Killed] ArithmeticOperator
src/components/Game/Game.ts:64:13
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex + 1,
             cellIndex + cellInRow,
-            cellIndex + cellInRow + 1,
+            cellIndex + cellInRow - 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow + 1,
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,10 +4,10 @@
      false,
      true,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:64:13
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex + 1,
             cellIndex + cellInRow,
-            cellIndex + cellInRow + 1,
+            cellIndex - cellInRow + 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow + 1,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:65:13
             cellIndex + 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow + 1,
-            cellIndex - cellInRow,
+            cellIndex + cellInRow,
             cellIndex - cellInRow + 1,
           ])

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:66:13
             cellIndex + cellInRow,
             cellIndex + cellInRow + 1,
             cellIndex - cellInRow,
-            cellIndex - cellInRow + 1,
+            cellIndex + cellInRow + 1,
           ])
           break

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:66:13
             cellIndex + cellInRow,
             cellIndex + cellInRow + 1,
             cellIndex - cellInRow,
-            cellIndex - cellInRow + 1,
+            cellIndex - cellInRow - 1,
           ])
           break

[Timeout] ConditionalExpression
src/components/Game/Game.ts:69:9
             cellIndex - cellInRow + 1,
           ])
           break
-        case cellInRow - 1:
-          aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex - 1,
-            cellIndex + cellInRow,
-            cellIndex + cellInRow - 1,
-            cellIndex - cellInRow,
-            cellIndex - cellInRow - 1,
-          ])
-          break
+        case cellInRow - 1:
         default:
           aliveNeighbourCount = sumNeighbours(states, [

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:71:13
           break
         case cellInRow - 1:
           aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex - 1,
+            cellIndex + 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:72:13
         case cellInRow - 1:
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex - 1,
-            cellIndex + cellInRow,
+            cellIndex - cellInRow,
             cellIndex + cellInRow - 1,
             cellIndex - cellInRow,

[Killed] ArithmeticOperator
src/components/Game/Game.ts:73:13
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex - 1,
             cellIndex + cellInRow,
-            cellIndex + cellInRow - 1,
+            cellIndex - cellInRow - 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,8 +6,8 @@
      false,
      false,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:73:13
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex - 1,
             cellIndex + cellInRow,
-            cellIndex + cellInRow - 1,
+            cellIndex + cellInRow + 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:74:13
             cellIndex - 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,
-            cellIndex - cellInRow,
+            cellIndex + cellInRow,
             cellIndex - cellInRow - 1,
           ])

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:75:13
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,
             cellIndex - cellInRow,
-            cellIndex - cellInRow - 1,
+            cellIndex + cellInRow - 1,
           ])
           break

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:75:13
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,
             cellIndex - cellInRow,
-            cellIndex - cellInRow - 1,
+            cellIndex - cellInRow + 1,
           ])
           break

[Killed] ConditionalExpression
src/components/Game/Game.ts:78:9
             cellIndex - cellInRow - 1,
           ])
           break
-        default:
-          aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex - 1,
-            cellIndex + 1,
-            cellIndex + cellInRow,
-            cellIndex + cellInRow - 1,
-            cellIndex + cellInRow + 1,
-            cellIndex - cellInRow,
-            cellIndex - cellInRow - 1,
-            cellIndex - cellInRow + 1,
-          ])
-          break
+        default:
       }
       break
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ArrayDeclaration
src/components/Game/Game.ts:79:55
           ])
           break
         default:
-          aliveNeighbourCount = sumNeighbours(states, [
-            cellIndex - 1,
-            cellIndex + 1,
-            cellIndex + cellInRow,
-            cellIndex + cellInRow - 1,
-            cellIndex + cellInRow + 1,
-            cellIndex - cellInRow,
-            cellIndex - cellInRow - 1,
-            cellIndex - cellInRow + 1,
-          ])
+          aliveNeighbourCount = sumNeighbours(states, [])
           break
       }

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:81:13
         default:
           aliveNeighbourCount = sumNeighbours(states, [
             cellIndex - 1,
-            cellIndex + 1,
+            cellIndex - 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,

[Killed] ArithmeticOperator
src/components/Game/Game.ts:84:13
             cellIndex + 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,
-            cellIndex + cellInRow + 1,
+            cellIndex - cellInRow + 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:84:13
             cellIndex + 1,
             cellIndex + cellInRow,
             cellIndex + cellInRow - 1,
-            cellIndex + cellInRow + 1,
+            cellIndex + cellInRow - 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:87:13
             cellIndex + cellInRow + 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,
-            cellIndex - cellInRow + 1,
+            cellIndex + cellInRow + 1,
           ])
           break

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:87:13
             cellIndex + cellInRow + 1,
             cellIndex - cellInRow,
             cellIndex - cellInRow - 1,
-            cellIndex - cellInRow + 1,
+            cellIndex - cellInRow - 1,
           ])
           break

[Killed] ConditionalExpression
src/components/Game/Game.ts:97:5
   const currentState = states[cellIndex]
 
   return (
-    (currentState &&
-      (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-    (!currentState && aliveNeighbourCount === 3)
+    false
   )
 }
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] LogicalOperator
src/components/Game/Game.ts:97:5
   const currentState = states[cellIndex]
 
   return (
-    (currentState &&
-      (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-    (!currentState && aliveNeighbourCount === 3)
+    currentState && (aliveNeighbourCount === 2 || aliveNeighbourCount === 3) && !currentState && aliveNeighbourCount === 3
   )
 }
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/components/Game/Game.ts:98:37
 
   return (
     (currentState &&
-      (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+      (aliveNeighbourCount === 2 || false)) ||
     (!currentState && aliveNeighbourCount === 3)
   )
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] EqualityOperator
src/components/Game/Game.ts:98:8
 
   return (
     (currentState &&
-      (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
+      (aliveNeighbourCount !== 2 || aliveNeighbourCount === 3)) ||
     (!currentState && aliveNeighbourCount === 3)
   )

[Killed] BooleanLiteral
src/components/Game/Game.ts:99:6
   return (
     (currentState &&
       (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-    (!currentState && aliveNeighbourCount === 3)
+    (currentState && aliveNeighbourCount === 3)
   )
 }
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ConditionalExpression
src/components/Game/Game.ts:99:23
   return (
     (currentState &&
       (aliveNeighbourCount === 2 || aliveNeighbourCount === 3)) ||
-    (!currentState && aliveNeighbourCount === 3)
+    (!currentState && true)
   )
 }

[Timeout] BlockStatement
src/components/Game/Game.ts:103:69
   )
 }
 
-const sumNeighbours = (states: boolean[], cellIndexes: number[]) => {
-  return cellIndexes
-    .map((index) => getValue(states, index))
-    .reduce((prev: number, cur: number) => prev + cur, 0)
-}
+const sumNeighbours = (states: boolean[], cellIndexes: number[]) => {}
 
 const getValue = (states: boolean[], cellIndex: number) => {

[Killed] ArrowFunction
src/components/Game/Game.ts:105:10
 
 const sumNeighbours = (states: boolean[], cellIndexes: number[]) => {
   return cellIndexes
-    .map((index) => getValue(states, index))
+    .map(() => undefined)
     .reduce((prev: number, cur: number) => prev + cur, 0)
 }
killedBy: nextStepForCell tests $index mutated 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Timeout] ArrowFunction
src/components/Game/Game.ts:106:13
 const sumNeighbours = (states: boolean[], cellIndexes: number[]) => {
   return cellIndexes
     .map((index) => getValue(states, index))
-    .reduce((prev: number, cur: number) => prev + cur, 0)
+    .reduce(() => undefined, 0)
 }
 

[Timeout] ArithmeticOperator
src/components/Game/Game.ts:106:44
 const sumNeighbours = (states: boolean[], cellIndexes: number[]) => {
   return cellIndexes
     .map((index) => getValue(states, index))
-    .reduce((prev: number, cur: number) => prev + cur, 0)
+    .reduce((prev: number, cur: number) => prev - cur, 0)
 }
 

[Timeout] BlockStatement
src/components/Game/Game.ts:109:60
     .reduce((prev: number, cur: number) => prev + cur, 0)
 }
 
-const getValue = (states: boolean[], cellIndex: number) => {
-  const boolValue =
-    cellIndex > 0 && cellIndex < states.length ? states[cellIndex] : false
-  return boolValue ? 1 : 0
-}
+const getValue = (states: boolean[], cellIndex: number) => {}
 
 const generateRandom = (maxLimit: number): number => {

[Timeout] EqualityOperator
src/components/Game/Game.ts:111:5
 
 const getValue = (states: boolean[], cellIndex: number) => {
   const boolValue =
-    cellIndex > 0 && cellIndex < states.length ? states[cellIndex] : false
+    cellIndex <= 0 && cellIndex < states.length ? states[cellIndex] : false
   return boolValue ? 1 : 0
 }

[Timeout] EqualityOperator
src/components/Game/Game.ts:111:22
 
 const getValue = (states: boolean[], cellIndex: number) => {
   const boolValue =
-    cellIndex > 0 && cellIndex < states.length ? states[cellIndex] : false
+    cellIndex > 0 && cellIndex >= states.length ? states[cellIndex] : false
   return boolValue ? 1 : 0
 }

[Timeout] BlockStatement
src/components/Game/Game.ts:115:54
   return boolValue ? 1 : 0
 }
 
-const generateRandom = (maxLimit: number): number => {
-  return Math.floor(Math.random() * maxLimit)
-}
+const generateRandom = (maxLimit: number): number => {}
 

[Survived] ArithmeticOperator
src/components/Game/Game.ts:116:21
 }
 
 const generateRandom = (maxLimit: number): number => {
-  return Math.floor(Math.random() * maxLimit)
+  return Math.floor(Math.random() / maxLimit)
 }
 
