[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:30:19
   const { running, restart, cellCount, percentage, speed, width, height } =
     useSelector<AppStateType, GameSliceState>(gameplayState)
 
-  useEffect(() => {
-    if (running && !gameState) {
-      dispatch(init({ cellCount, percentage }))
-    }
-  }, [running, gameState])
+  useEffect(() => {}, [running, gameState])
   useEffect(() => {
     dispatch(init({ cellCount, percentage }))

[Timeout] BooleanLiteral
src/components/GamePanel/GamePanel.tsx:31:20
     useSelector<AppStateType, GameSliceState>(gameplayState)
 
   useEffect(() => {
-    if (running && !gameState) {
+    if (running && gameState) {
       dispatch(init({ cellCount, percentage }))
     }

[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:31:32
     useSelector<AppStateType, GameSliceState>(gameplayState)
 
   useEffect(() => {
-    if (running && !gameState) {
-      dispatch(init({ cellCount, percentage }))
-    }
+    if (running && !gameState) {}
   }, [running, gameState])
   useEffect(() => {

[Survived] ArrayDeclaration
src/components/GamePanel/GamePanel.tsx:34:6
     if (running && !gameState) {
       dispatch(init({ cellCount, percentage }))
     }
-  }, [running, gameState])
+  }, [])
   useEffect(() => {
     dispatch(init({ cellCount, percentage }))

[Killed] BlockStatement
src/components/GamePanel/GamePanel.tsx:35:19
       dispatch(init({ cellCount, percentage }))
     }
   }, [running, gameState])
-  useEffect(() => {
-    dispatch(init({ cellCount, percentage }))
-  }, [restart, cellCount, percentage])
+  useEffect(() => {}, [restart, cellCount, percentage])
 
   useEffect(() => {
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ObjectLiteral
src/components/GamePanel/GamePanel.tsx:36:19
     }
   }, [running, gameState])
   useEffect(() => {
-    dispatch(init({ cellCount, percentage }))
+    dispatch(init({}))
   }, [restart, cellCount, percentage])
 
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:39:19
     dispatch(init({ cellCount, percentage }))
   }, [restart, cellCount, percentage])
 
-  useEffect(() => {
-    if (running) {
-      const timer = setTimeout(() => {
-        const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
-        dispatch(nextState({ cellInRow }))
-      }, 1000 / speed)
-      return () => clearTimeout(timer)
-    }
-  })
+  useEffect(() => {})
 
   const { setUserName } = useContext(AuthContext)

[Survived] ConditionalExpression
src/components/GamePanel/GamePanel.tsx:40:9
   }, [restart, cellCount, percentage])
 
   useEffect(() => {
-    if (running) {
+    if (false) {
       const timer = setTimeout(() => {
         const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0

[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:40:18
   }, [restart, cellCount, percentage])
 
   useEffect(() => {
-    if (running) {
-      const timer = setTimeout(() => {
-        const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
-        dispatch(nextState({ cellInRow }))
-      }, 1000 / speed)
-      return () => clearTimeout(timer)
-    }
+    if (running) {}
   })
 

[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:41:38
 
   useEffect(() => {
     if (running) {
-      const timer = setTimeout(() => {
-        const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
-        dispatch(nextState({ cellInRow }))
-      }, 1000 / speed)
+      const timer = setTimeout(() => {}, 1000 / speed)
       return () => clearTimeout(timer)
     }

[Survived] ArithmeticOperator
src/components/GamePanel/GamePanel.tsx:44:10
       const timer = setTimeout(() => {
         const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
         dispatch(nextState({ cellInRow }))
-      }, 1000 / speed)
+      }, 1000 * speed)
       return () => clearTimeout(timer)
     }

[Survived] ArrowFunction
src/components/GamePanel/GamePanel.tsx:45:14
         const cellInRow = cellCount ? Math.ceil(Math.sqrt(cellCount)) : 0
         dispatch(nextState({ cellInRow }))
       }, 1000 / speed)
-      return () => clearTimeout(timer)
+      return () => undefined
     }
   })

[Survived] StringLiteral
src/components/GamePanel/GamePanel.tsx:54:56
   return (
     <div style={{ width: GAME_FIELDWIDTH }}>
       <div style={{ fontSize: 18, paddingBottom: 20, color: "red" }}>
-        Welcome to game of life, {localStorage.getItem("auth")}!
+        Welcome to game of life, {localStorage.getItem("")}!
         &nbsp;&nbsp;&nbsp;
         <button

[Survived] BlockStatement
src/components/GamePanel/GamePanel.tsx:58:26
         &nbsp;&nbsp;&nbsp;
         <button
           type="submit"
-          onClick={() => {
-            window.location.href = "/login"
-            setUserName(null)
-            localStorage.removeItem("auth")
-          }}
+          onClick={() => {}}
         >
           Logout

[Killed] ArrowFunction
src/components/GamePanel/GamePanel.tsx:68:20
         </button>
       </div>
       <PlayProp
-        onRestart={() => dispatch(restartGame())}
+        onRestart={() => undefined}
         onPlayChange={(val) => dispatch(val ? startGame() : stopGame())}
         onSpeedChange={(s) => dispatch(gameSpeed({ value: s }))}
killedBy: render tests after stop state the same
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ArrowFunction
src/components/GamePanel/GamePanel.tsx:69:23
       </div>
       <PlayProp
         onRestart={() => dispatch(restartGame())}
-        onPlayChange={(val) => dispatch(val ? startGame() : stopGame())}
+        onPlayChange={() => undefined}
         onSpeedChange={(s) => dispatch(gameSpeed({ value: s }))}
       ></PlayProp>

[Survived] ArrowFunction
src/components/GamePanel/GamePanel.tsx:70:24
       <PlayProp
         onRestart={() => dispatch(restartGame())}
         onPlayChange={(val) => dispatch(val ? startGame() : stopGame())}
-        onSpeedChange={(s) => dispatch(gameSpeed({ value: s }))}
+        onSpeedChange={() => undefined}
       ></PlayProp>
       <FieldProp

[Killed] ArrowFunction
src/components/GamePanel/GamePanel.tsx:73:28
         onSpeedChange={(s) => dispatch(gameSpeed({ value: s }))}
       ></PlayProp>
       <FieldProp
-        onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
+        onCellCountChange={() => undefined}
         onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Killed] ObjectLiteral
src/components/GamePanel/GamePanel.tsx:73:58
         onSpeedChange={(s) => dispatch(gameSpeed({ value: s }))}
       ></PlayProp>
       <FieldProp
-        onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
+        onCellCountChange={(c) => dispatch(gameCellCount({}))}
         onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Survived] ArrowFunction
src/components/GamePanel/GamePanel.tsx:74:25
       ></PlayProp>
       <FieldProp
         onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
-        onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
+        onHeightChange={() => undefined}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
         onWidthChange={(w) => dispatch(fieldWidth({ value: w }))}

[Survived] ObjectLiteral
src/components/GamePanel/GamePanel.tsx:74:53
       ></PlayProp>
       <FieldProp
         onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
-        onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
+        onHeightChange={(h) => dispatch(fieldHeight({}))}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
         onWidthChange={(w) => dispatch(fieldWidth({ value: w }))}

[Killed] ArrowFunction
src/components/GamePanel/GamePanel.tsx:75:29
       <FieldProp
         onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
         onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
-        onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
+        onPopulationChange={() => undefined}
         onWidthChange={(w) => dispatch(fieldWidth({ value: w }))}
       ></FieldProp>
killedBy: render tests state test percentage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArrowFunction
src/components/GamePanel/GamePanel.tsx:76:24
         onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
         onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
-        onWidthChange={(w) => dispatch(fieldWidth({ value: w }))}
+        onWidthChange={() => undefined}
       ></FieldProp>
       <Field width={width} height={height} cellCount={cellCount} />

[Survived] ObjectLiteral
src/components/GamePanel/GamePanel.tsx:76:51
         onCellCountChange={(c) => dispatch(gameCellCount({ value: c }))}
         onHeightChange={(h) => dispatch(fieldHeight({ value: h }))}
         onPopulationChange={(p) => dispatch(fillPercentage({ value: p }))}
-        onWidthChange={(w) => dispatch(fieldWidth({ value: w }))}
+        onWidthChange={(w) => dispatch(fieldWidth({}))}
       ></FieldProp>
       <Field width={width} height={height} cellCount={cellCount} />
