[Killed] BlockStatement
src/components/Input/NumberTextBox.tsx:3:41
 import { useState, memo, DetailedHTMLProps } from "react"
 
-export const isNum = (value: string) => {
-  return /[0-9]/.test(value)
-}
+export const isNum = (value: string) => {}
 
 interface TextBoxProps
killedBy: change value tests enter number and char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] Regex
src/components/Input/NumberTextBox.tsx:4:10
 import { useState, memo, DetailedHTMLProps } from "react"
 
 export const isNum = (value: string) => {
-  return /[0-9]/.test(value)
+  return /[^0-9]/.test(value)
 }
 
killedBy: change value tests enter number and char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/components/Input/NumberTextBox.tsx:18:64
 }
 
 export const NumberTextBox = memo<TextBoxProps>(
-  ({ defaultValue, placeHolder, onValueChange, className }) => {
-    const [value, setValue] = useState(defaultValue)
-    return (
-      <input
-        type="text"
-        value={value}
-        placeholder={placeHolder}
-        className={className}
-        onChange={(e) => {
-          const val: number =
-            e.target.value && isNum(e.target.value)
-              ? parseInt(e.target.value)
-              : 0
-          setValue(val)
-          onValueChange(val)
-        }}
-        onKeyPress={(event) => {
-          if (event.key) {
-            event.preventDefault()
-          }
-        }}
-      ></input>
-    )
-  }
+  ({ defaultValue, placeHolder, onValueChange, className }) => {}
 )
 
killedBy: render tests numberTextBox render
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Test

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/Input/NumberTextBox.tsx:26:26
         value={value}
         placeholder={placeHolder}
         className={className}
-        onChange={(e) => {
-          const val: number =
-            e.target.value && isNum(e.target.value)
-              ? parseInt(e.target.value)
-              : 0
-          setValue(val)
-          onValueChange(val)
-        }}
+        onChange={(e) => {}}
         onKeyPress={(event) => {
           if (event.key) {
killedBy: change value tests enter number and char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/components/Input/NumberTextBox.tsx:28:13
         className={className}
         onChange={(e) => {
           const val: number =
-            e.target.value && isNum(e.target.value)
+            true
               ? parseInt(e.target.value)
               : 0
killedBy: change value tests enter number and char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ConditionalExpression
src/components/Input/NumberTextBox.tsx:28:13
         className={className}
         onChange={(e) => {
           const val: number =
-            e.target.value && isNum(e.target.value)
+            false
               ? parseInt(e.target.value)
               : 0
killedBy: change value tests enter number and char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
src/components/Input/NumberTextBox.tsx:34:32
           setValue(val)
           onValueChange(val)
         }}
-        onKeyPress={(event) => {
-          if (event.key) {
-            event.preventDefault()
-          }
-        }}
+        onKeyPress={(event) => {}}
       ></input>
     )

[Survived] BlockStatement
src/components/Input/NumberTextBox.tsx:35:26
           onValueChange(val)
         }}
         onKeyPress={(event) => {
-          if (event.key) {
-            event.preventDefault()
-          }
+          if (event.key) {}
         }}
       ></input>

[Survived] ConditionalExpression
src/components/Input/NumberTextBox.tsx:35:15
           onValueChange(val)
         }}
         onKeyPress={(event) => {
-          if (event.key) {
+          if (false) {
             event.preventDefault()
           }
