[Killed] ArrowFunction
src/components/GameSettingsPanel/Group.tsx:9:55
   children?: React.ReactNode
 }
 
-export const SettingsPanel: React.FC<SettingsProps> = ({ title, children }) => (
-  <div className={styles.group}>
-    <div className={styles.groupLabelWrapper}>
-      <div className={styles.groupLabel}>{title}</div>
-    </div>
-    <div className={styles.groupFrame}>{children}</div>
-  </div>
-)
+export const SettingsPanel: React.FC<SettingsProps> = () => undefined
 
killedBy: render tests render
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="speed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="width: 500px;"
    >
