[Killed] BooleanLiteral
src/components/PlayProp/PlayProp.tsx:18:46
   onRestart,
   onSpeedChange,
 }: PlayPropProps) => {
-  const [isRunnung, setIsRunnung] = useState(true)
+  const [isRunnung, setIsRunnung] = useState(false)
   const onClickRunButton = () => {
     setIsRunnung((prev) => !prev)
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/components/PlayProp/PlayProp.tsx:19:34
   onSpeedChange,
 }: PlayPropProps) => {
   const [isRunnung, setIsRunnung] = useState(true)
-  const onClickRunButton = () => {
-    setIsRunnung((prev) => !prev)
-  }
+  const onClickRunButton = () => {}
   const onClickRestartButton = () => {
     onRestart()
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/components/PlayProp/PlayProp.tsx:20:28
 }: PlayPropProps) => {
   const [isRunnung, setIsRunnung] = useState(true)
   const onClickRunButton = () => {
-    setIsRunnung((prev) => !prev)
+    setIsRunnung((prev) => prev)
   }
   const onClickRestartButton = () => {
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/components/PlayProp/PlayProp.tsx:20:18
 }: PlayPropProps) => {
   const [isRunnung, setIsRunnung] = useState(true)
   const onClickRunButton = () => {
-    setIsRunnung((prev) => !prev)
+    setIsRunnung(() => undefined)
   }
   const onClickRestartButton = () => {
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/components/PlayProp/PlayProp.tsx:22:38
   const onClickRunButton = () => {
     setIsRunnung((prev) => !prev)
   }
-  const onClickRestartButton = () => {
-    onRestart()
-    setIsRunnung(true)
-  }
+  const onClickRestartButton = () => {}
   useEffect(() => {
     onPlayChange(isRunnung)
killedBy: render tests after stop state the same
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] BooleanLiteral
src/components/PlayProp/PlayProp.tsx:24:18
   }
   const onClickRestartButton = () => {
     onRestart()
-    setIsRunnung(true)
+    setIsRunnung(false)
   }
   useEffect(() => {

[Killed] BlockStatement
src/components/PlayProp/PlayProp.tsx:26:19
     onRestart()
     setIsRunnung(true)
   }
-  useEffect(() => {
-    onPlayChange(isRunnung)
-  }, [isRunnung])
+  useEffect(() => {}, [isRunnung])
   const btnStyle = `${styles.playProp} ${styles.playPropButton}`
   return (
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
