[Survived] ArrowFunction
src/components/ProviderWrapper/ProviderWrapper.tsx:8:64
   children: React.ReactNode
   store: Store
 }
-export const ProviderWrapper: React.FC<ProviderWrapperProps> = ({
-  children,
-  store,
-}) => <Provider store={store}>{children}</Provider>
+export const ProviderWrapper: React.FC<ProviderWrapperProps> = () => undefined
 
