[Survived] BooleanLiteral
src/components/Routes/AppRouter.tsx:8:48
 
 export const AppRouter: React.FC = () => {
   const [userName, setUserName] = useState<string | null>(null)
-  const [hasAuthData, initAuthData] = useState(false)
+  const [hasAuthData, initAuthData] = useState(true)
   useEffect(() => {
     setUserName(localStorage.getItem("auth"))

[Killed] BlockStatement
src/components/Routes/AppRouter.tsx:9:19
 export const AppRouter: React.FC = () => {
   const [userName, setUserName] = useState<string | null>(null)
   const [hasAuthData, initAuthData] = useState(false)
-  useEffect(() => {
-    setUserName(localStorage.getItem("auth"))
-    initAuthData(true)
-  }, [])
+  useEffect(() => {}, [])
 
   if (!hasAuthData) {
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/components/Routes/AppRouter.tsx:10:38
   const [userName, setUserName] = useState<string | null>(null)
   const [hasAuthData, initAuthData] = useState(false)
   useEffect(() => {
-    setUserName(localStorage.getItem("auth"))
+    setUserName(localStorage.getItem(""))
     initAuthData(true)
   }, [])

[Killed] BooleanLiteral
src/components/Routes/AppRouter.tsx:11:18
   const [hasAuthData, initAuthData] = useState(false)
   useEffect(() => {
     setUserName(localStorage.getItem("auth"))
-    initAuthData(true)
+    initAuthData(false)
   }, [])
 
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/components/Routes/AppRouter.tsx:14:7
     initAuthData(true)
   }, [])
 
-  if (!hasAuthData) {
+  if (hasAuthData) {
     return null
   }
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/Routes/AppRouter.tsx:14:7
     initAuthData(true)
   }, [])
 
-  if (!hasAuthData) {
+  if (true) {
     return null
   }
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "textbox"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ArrowFunction
src/components/Routes/AppRouter.tsx:27:39
     <Routes>
       <Route
         path="/login"
-        element={<LoginForm onSubmit={() => setUserName("")} />}
+        element={<LoginForm onSubmit={() => undefined} />}
       />
       <Route path="/" element={<Navigate to="/login" />} />
