[Killed] BlockStatement
src/components/SpeedEdit/SpeedEdit.tsx:22:19
   onValueChange,
 }: SpeedEditProps) => {
   const [value, setValue] = useState(startValue)
-  useEffect(() => {
-    if (value) {
-      onValueChange(value)
-    }
-  }, [value])
+  useEffect(() => {}, [value])
   return (
     <div className={styles.speedEditContainer}>
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Killed] BlockStatement
src/components/SpeedEdit/SpeedEdit.tsx:23:16
 }: SpeedEditProps) => {
   const [value, setValue] = useState(startValue)
   useEffect(() => {
-    if (value) {
-      onValueChange(value)
-    }
+    if (value) {}
   }, [value])
   return (
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] ConditionalExpression
src/components/SpeedEdit/SpeedEdit.tsx:23:9
 }: SpeedEditProps) => {
   const [value, setValue] = useState(startValue)
   useEffect(() => {
-    if (value) {
+    if (false) {
       onValueChange(value)
     }
killedBy: render tests input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] ArrayDeclaration
src/components/SpeedEdit/SpeedEdit.tsx:26:6
     if (value) {
       onValueChange(value)
     }
-  }, [value])
+  }, [])
   return (
     <div className={styles.speedEditContainer}>
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Survived] StringLiteral
src/components/SpeedEdit/SpeedEdit.tsx:33:27
         <input
           placeholder={placeHolder}
           value={value}
-          style={{ width: "30px", color: "#41cb71" }}
+          style={{ width: "", color: "#41cb71" }}
           onChange={(e) => {
             const val =

[Killed] BlockStatement
src/components/SpeedEdit/SpeedEdit.tsx:34:28
           placeholder={placeHolder}
           value={value}
           style={{ width: "30px", color: "#41cb71" }}
-          onChange={(e) => {
-            const val =
-              e.target.value && isNum(e.target.value)
-                ? parseInt(e.target.value)
-                : 0
-            setValue(val)
-          }}
+          onChange={(e) => {}}
           onKeyPress={(event) => {
             if (!isNum(event.key)) {
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Killed] ConditionalExpression
src/components/SpeedEdit/SpeedEdit.tsx:36:15
           style={{ width: "30px", color: "#41cb71" }}
           onChange={(e) => {
             const val =
-              e.target.value && isNum(e.target.value)
+              false
                 ? parseInt(e.target.value)
                 : 0
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Survived] LogicalOperator
src/components/SpeedEdit/SpeedEdit.tsx:36:15
           style={{ width: "30px", color: "#41cb71" }}
           onChange={(e) => {
             const val =
-              e.target.value && isNum(e.target.value)
+              e.target.value || isNum(e.target.value)
                 ? parseInt(e.target.value)
                 : 0

[Survived] BlockStatement
src/components/SpeedEdit/SpeedEdit.tsx:41:34
                 : 0
             setValue(val)
           }}
-          onKeyPress={(event) => {
-            if (!isNum(event.key)) {
-              event.preventDefault()
-            }
-          }}
+          onKeyPress={(event) => {}}
         ></input>
       </div>

[Survived] ConditionalExpression
src/components/SpeedEdit/SpeedEdit.tsx:42:17
             setValue(val)
           }}
           onKeyPress={(event) => {
-            if (!isNum(event.key)) {
+            if (false) {
               event.preventDefault()
             }

[Survived] ConditionalExpression
src/components/SpeedEdit/SpeedEdit.tsx:42:17
             setValue(val)
           }}
           onKeyPress={(event) => {
-            if (!isNum(event.key)) {
+            if (true) {
               event.preventDefault()
             }
