[Killed] BlockStatement
src/components/Store/flowSlice.ts:17:42
     value: [],
   } as FlowSliceState,
   reducers: {
-    init: (state, action: ActionType) => {
-      state.value =
-        action.payload.cellCount &&
-        (action.payload.percentage || action.payload.percentage === 0)
-          ? initialize(action.payload.cellCount, action.payload.percentage)
-          : state.value
-    },
+    init: (state, action: ActionType) => {},
     mutate: (state, action: ActionType) => {
       state.value =
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/components/Store/flowSlice.ts:19:9
   reducers: {
     init: (state, action: ActionType) => {
       state.value =
-        action.payload.cellCount &&
-        (action.payload.percentage || action.payload.percentage === 0)
+        false
           ? initialize(action.payload.cellCount, action.payload.percentage)
           : state.value
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Survived] LogicalOperator
src/components/Store/flowSlice.ts:19:9
   reducers: {
     init: (state, action: ActionType) => {
       state.value =
-        action.payload.cellCount &&
-        (action.payload.percentage || action.payload.percentage === 0)
+        action.payload.cellCount || action.payload.percentage || action.payload.percentage === 0
           ? initialize(action.payload.cellCount, action.payload.percentage)
           : state.value

[Killed] LogicalOperator
src/components/Store/flowSlice.ts:20:10
     init: (state, action: ActionType) => {
       state.value =
         action.payload.cellCount &&
-        (action.payload.percentage || action.payload.percentage === 0)
+        (action.payload.percentage && action.payload.percentage === 0)
           ? initialize(action.payload.cellCount, action.payload.percentage)
           : state.value
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Survived] EqualityOperator
src/components/Store/flowSlice.ts:20:39
     init: (state, action: ActionType) => {
       state.value =
         action.payload.cellCount &&
-        (action.payload.percentage || action.payload.percentage === 0)
+        (action.payload.percentage || action.payload.percentage !== 0)
           ? initialize(action.payload.cellCount, action.payload.percentage)
           : state.value

[Killed] BlockStatement
src/components/Store/flowSlice.ts:24:44
           ? initialize(action.payload.cellCount, action.payload.percentage)
           : state.value
     },
-    mutate: (state, action: ActionType) => {
-      state.value =
-        state.value &&
-        (action.payload.cellIndex || action.payload.cellIndex === 0)
-          ? mutateCell(action.payload.cellIndex, state.value)
-          : state.value
-    },
+    mutate: (state, action: ActionType) => {},
     nextState: (state, action: ActionType) => {
       state.value =
killedBy: flowSlice states tests 'mutate' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "value": Array [
-     false,

[Killed] ConditionalExpression
src/components/Store/flowSlice.ts:26:9
     },
     mutate: (state, action: ActionType) => {
       state.value =
-        state.value &&
-        (action.payload.cellIndex || action.payload.cellIndex === 0)
+        false
           ? mutateCell(action.payload.cellIndex, state.value)
           : state.value
killedBy: flowSlice states tests 'mutate' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "value": Array [
-     false,

[Survived] LogicalOperator
src/components/Store/flowSlice.ts:26:9
     },
     mutate: (state, action: ActionType) => {
       state.value =
-        state.value &&
-        (action.payload.cellIndex || action.payload.cellIndex === 0)
+        state.value || action.payload.cellIndex || action.payload.cellIndex === 0
           ? mutateCell(action.payload.cellIndex, state.value)
           : state.value

[Killed] EqualityOperator
src/components/Store/flowSlice.ts:27:38
     mutate: (state, action: ActionType) => {
       state.value =
         state.value &&
-        (action.payload.cellIndex || action.payload.cellIndex === 0)
+        (action.payload.cellIndex || action.payload.cellIndex !== 0)
           ? mutateCell(action.payload.cellIndex, state.value)
           : state.value
killedBy: flowSlice states tests 'mutate' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "value": Array [
-     false,

[Killed] ConditionalExpression
src/components/Store/flowSlice.ts:27:38
     mutate: (state, action: ActionType) => {
       state.value =
         state.value &&
-        (action.payload.cellIndex || action.payload.cellIndex === 0)
+        (action.payload.cellIndex || false)
           ? mutateCell(action.payload.cellIndex, state.value)
           : state.value
killedBy: flowSlice states tests 'mutate' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "value": Array [
-     false,

[Killed] BlockStatement
src/components/Store/flowSlice.ts:31:47
           ? mutateCell(action.payload.cellIndex, state.value)
           : state.value
     },
-    nextState: (state, action: ActionType) => {
-      state.value =
-        state.value && action.payload.cellInRow
-          ? nextStep(state.value, action.payload.cellInRow)
-          : state.value
-    },
+    nextState: (state, action: ActionType) => {},
   },
 })
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "value": Array [
      true,

[Killed] ConditionalExpression
src/components/Store/flowSlice.ts:33:9
     },
     nextState: (state, action: ActionType) => {
       state.value =
-        state.value && action.payload.cellInRow
+        false
           ? nextStep(state.value, action.payload.cellInRow)
           : state.value
killedBy: flowSlice states tests 'nextState' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
    "value": Array [
      true,

[Survived] LogicalOperator
src/components/Store/flowSlice.ts:33:9
     },
     nextState: (state, action: ActionType) => {
       state.value =
-        state.value && action.payload.cellInRow
+        state.value || action.payload.cellInRow
           ? nextStep(state.value, action.payload.cellInRow)
           : state.value
