[Survived] BlockStatement
src/components/Store/gameplaySlice.ts:40:27
   name: "gameplay",
   initialState: initialState,
   reducers: {
-    startGame: (state) => {
-      state.running = true
-    },
+    startGame: (state) => {},
     stopGame: (state) => {
       state.running = false

[Killed] BooleanLiteral
src/components/Store/gameplaySlice.ts:41:23
   initialState: initialState,
   reducers: {
     startGame: (state) => {
-      state.running = true
+      state.running = false
     },
     stopGame: (state) => {
killedBy: flowSlice states tests 'startGame' state test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:43:26
     startGame: (state) => {
       state.running = true
     },
-    stopGame: (state) => {
-      state.running = false
-    },
+    stopGame: (state) => {},
     restartGame: (state) => {
       state.restart = !state.restart
killedBy: flowSlice states tests 'stopGame' state test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/components/Store/gameplaySlice.ts:44:23
       state.running = true
     },
     stopGame: (state) => {
-      state.running = false
+      state.running = true
     },
     restartGame: (state) => {
killedBy: flowSlice states tests 'stopGame' state test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:46:29
     stopGame: (state) => {
       state.running = false
     },
-    restartGame: (state) => {
-      state.restart = !state.restart
-    },
+    restartGame: (state) => {},
     gameSpeed: (state, action: GameStateAction) => {
       state.speed = action.payload.value
killedBy: render tests after restart state changed
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BooleanLiteral
src/components/Store/gameplaySlice.ts:47:23
       state.running = false
     },
     restartGame: (state) => {
-      state.restart = !state.restart
+      state.restart = state.restart
     },
     gameSpeed: (state, action: GameStateAction) => {
killedBy: render tests after restart state changed
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:49:52
     restartGame: (state) => {
       state.restart = !state.restart
     },
-    gameSpeed: (state, action: GameStateAction) => {
-      state.speed = action.payload.value
-    },
+    gameSpeed: (state, action: GameStateAction) => {},
     fieldWidth: (state, action: GameStateAction) => {
       state.width = action.payload.value
killedBy: flowSlice states tests 'gameSpeed' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 1

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:52:53
     gameSpeed: (state, action: GameStateAction) => {
       state.speed = action.payload.value
     },
-    fieldWidth: (state, action: GameStateAction) => {
-      state.width = action.payload.value
-    },
+    fieldWidth: (state, action: GameStateAction) => {},
     fieldHeight: (state, action: GameStateAction) => {
       state.height = action.payload.value
killedBy: flowSlice states tests 'fieldWidth' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 500

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:55:54
     fieldWidth: (state, action: GameStateAction) => {
       state.width = action.payload.value
     },
-    fieldHeight: (state, action: GameStateAction) => {
-      state.height = action.payload.value
-    },
+    fieldHeight: (state, action: GameStateAction) => {},
     gameCellCount: (state, action: GameStateAction) => {
       state.cellCount = action.payload.value
killedBy: flowSlice states tests 'fieldHeight' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 500

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:58:56
     fieldHeight: (state, action: GameStateAction) => {
       state.height = action.payload.value
     },
-    gameCellCount: (state, action: GameStateAction) => {
-      state.cellCount = action.payload.value
-    },
+    gameCellCount: (state, action: GameStateAction) => {},
     fillPercentage: (state, action: GameStateAction) => {
       state.percentage = action.payload.value
killedBy: render tests state test cells count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 625

[Killed] BlockStatement
src/components/Store/gameplaySlice.ts:61:57
     gameCellCount: (state, action: GameStateAction) => {
       state.cellCount = action.payload.value
     },
-    fillPercentage: (state, action: GameStateAction) => {
-      state.percentage = action.payload.value
-    },
+    fillPercentage: (state, action: GameStateAction) => {},
   },
 })
killedBy: flowSlice states tests 'fillPercentage' state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 50
