[Killed] ArrowFunction
src/components/Store/store.ts:17:30
   },
 })
 
-export const gameplayState = (state: AppStateType) => state.gameplay
+export const gameplayState = () => undefined
 
 export const flowState = (state: AppStateType) => state.flow
killedBy: render tests render
statusReason: TypeError: Cannot destructure property 'running' of '(0 , _reactRedux.useSelector)(...)' as it is undefined.

[Killed] ArrowFunction
src/components/Store/store.ts:19:26
 
 export const gameplayState = (state: AppStateType) => state.gameplay
 
-export const flowState = (state: AppStateType) => state.flow
+export const flowState = () => undefined
 
killedBy: render tests render
statusReason: TypeError: Cannot destructure property 'value' of '(0 , _reactRedux.useSelector)(...)' as it is undefined.
